app/controllers/pepes_controller.rb

  def index
    @pepes = Pepe.all
---
SELECT "pepes".* FROM "pepes"

  def create
    @pepe = Pepe.new(pepe_params)

    respond_to do |format|
      if @pepe.save
---
INSERT INTO "pepes" ("atributo", "atributro2", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["atributo", "Prueba"], ["atributro2", 1], ["created_at", "2020-12-03 21:58:01.111523"], ["updated_at", "2020-12-03 21:58:01.111523"]]

  def update
    respond_to do |format|
      if @pepe.update(pepe_params)
---
UPDATE "pepes" SET "atributo" = ?, "updated_at" = ? WHERE "pepes"."id" = ?  [["atributo", "Contenido atributo"], ["updated_at", "2020-12-18 11:22:22.979959"], ["id", 1]]

    def set_pepe
      @pepe = Pepe.find(params[:id])
---
SELECT  "pepes".* FROM "pepes" WHERE "pepes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]